/********************************************************************************
 * @版本  ：V1.0
 * @文件  : sysbsp.c
 * @作者  : caochao
 * @日期  : 9-19-2018
 * @版本  : version1.0
 * @单位  : 西安电子科技大学
 * @摘要  : 这个C文件时硬件的初始化
 *
 * 修改人 :
 *  日期  :
 *
 * 修改人 :
 *  日期  :
 
 ********************************************************************************/
#include "stm32f4xx.h"
#include "includes.h"
#include "sysbsp.h"

/********************************************************************************
 *  函数名:  BSP_Init
 *  功  能:  系统硬件的初始化
 *  输  入:   
 *           无
 *  输  出:   
 *           true：初始化成功
 *          false：初始化失败
 ********************************************************************************/
bool SYSBSP_Init(void)
{ 
    bool     flag;
    uint8_t  data = 0;
    uint8_t  Status = 0;  //保存状态
    
    /*初始化key*/
//    KEY1_Init();
//    KEY2_Init();
//    KEY3_Init();
//    KEY4_Init();
//    
    /*初始化led*/
    LED1_Init();
    LED2_Init();
    LED3_Init();

    /*初始化串口*/
    USART1_Configuration();

    return true;
}
/**************************************文件结束*************************************/

